---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionType.ApplyTo
source: html/3d863213-6baf-3eaf-79f4-8f92a294bc93.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionType.ApplyTo Property

Choose whether this connection type applies to beams and
 braces, to tops of columns, or to bases of columns.

## Syntax (C#)
```csharp
public StructuralConnectionApplyTo ApplyTo { get; }
```

## Remarks
The property cannot be changed. Create a new
 StructuralConnectionType if a different value is needed.